doc/project-developing-basics.org
#+title: Flakes Basic Development Guide
#+setupfile: internal/links.org

* Org-mode setup :noexport:

** Variables

We set variables in =internal/params.el= and access those settings with the
following macros and source code blocks (using Noweb).

#+name: get
#+begin_src emacs-lisp :var arg="" :eval yes :results silent
(alist-get (intern arg) (car (read-from-string (f-read "internal/params.el"))))
#+end_src

** Formatting help

This snippet can be used as a post-processing step to crop down the results from
an evaluation of a source code block.

#+name: crop
#+begin_src emacs-lisp :var text="" :var first-n=5 :var last-n=5 :results silent
(let* ((ls         (split-string text "\n"))
       (first-ls   (-take first-n ls))
       (rest-first (-drop first-n ls))
       (rest-last  (-drop-last (+ 1 last-n) rest-first))
       (last-ls    (-take-last (+ 1 last-n) rest-first)))
  (string-join
   ;; DESIGN: org2gfm deletes Markdown, making project "dirty"
         (-filter (lambda (s) (not (s-matches? "^warning: .*is dirty$" s)))
                  (if rest-last
                      (append first-ls '("…") last-ls)
                    (append first-ls last-ls)))
   "\n"))
#+end_src

** Setup action

#+name: cleanup
#+begin_src sh :dir .. :results output silent
rm --recursive --force /tmp/my-project-less
#+end_src

* About this document

This document shows how to get started managing a software project using the
following in conjunction:
- the [[nix][Nix package manager]]
- an experimental feature of Nix called [[nix-wiki-flakes][flakes]]
- this project, Nix-project.

This document focuses on basics, without the added abstraction complexity of
third-party support like [[flake-utils][=flake-utils=]] or [[flake-parts][=flake-parts=]].  A [[file:project-developing-modules.org][separate document]]
covers development with flakes modules (using =flake-parts=).

Nix-project exists just as much to provide examples of recommended practices and
documentation as to offer supporting libraries.  Nothing Nix-project provides is
essential, but it is actively used by a few projects maintained by the same
author.

#+begin_quote
*_NOTE:_* To understand more about why to use an experimental feature such as
flakes, as well as known trade-offs, please read the provided [[file:nix-introduction.org][supplemental
documentation on Nix]].
#+end_quote

* Prerequisites

If you're new to Nix, consider reading the provided [[file:nix-introduction.org][introduction]].

If you don't have Nix set up yet, see the provided [[file:nix-installation.org][installation and
configuration guide]]. You will need Nix's experimental flakes feature enabled to
continue following this development guide.  Otherwise, you'll need to pass
~--extra-experimental-features 'nix-command flakes'~ explicitly to call
invocations of the =nix= command.

If you don't know how to use basic Nix commands, see the provided [[file:nix-usage-flakes.org][usage guide]].

If you're new to the Nix programming language, see the provided [[file:nix-language.org][language
tutorial]].

* Scaffolding

Nix-project provides two templates you can use to scaffold a new project:
- =less=: uses Nix flakes directly without projects like [[flake-utils][flake-utils]] or
  [[flake-parts][flake-parts]]
- =more=: uses flakes with more third-party support like [[flake-parts][flake-parts]].

Though implemented differently, both =less= and =more= templates have feature
parity. That way, you can more easily see how to extend your own project
in two different styles.

Adoption of =flake-parts= by the community has been partial.  Some appreciate
the community-curated module ecosystem it enables.  Others dislike the
additional abstraction complexity.  Note, there's little reason to use
=flake-utils= given we can get the same benefit with under ten lines of Nix code
as illustrated in the =less= template.

Regardless of whether you use =flake-parts= or not, it's good to understand how to
use Nix flakes directly.  The rest of this document focuses on the =less=
template.  A [[file:project-developing-modules.org][companion document]] walks through the =more= template.

** Scaffolding a new project

We can scaffold a project with the =less= template with the following command:

#+begin_src sh :eval no
nix --refresh \
    flake new \
    --template github:shajra/nix-project/main#less \
    /tmp/my-project-less  # or wherever you want your new project
#+end_src

#+name: scaffold-less
#+begin_src sh :dir .. :results output :exports results :post crop(text=*this*, first-n=100, last-n=0)
nix --refresh \
    flake new \
    --template .#less \
    /tmp/my-project-less 2>&1
#+end_src

#+RESULTS: scaffold-less
: wrote: "/tmp/my-project-less/README.org"
: wrote: "/tmp/my-project-less/config.nix"
: wrote: "/tmp/my-project-less/flake.nix"
: wrote: "/tmp/my-project-less/nix/my-app.nix"
: wrote: "/tmp/my-project-less/nix/overlay.nix"
: wrote: "/tmp/my-project-less/nix"

The =--refresh= assures that you get the latest template rather than a cached
version from a previous invocation.

As is common for all flake-based projects, [[file:../examples/less/flake.nix][=flake.nix=]] is the top-level build
file. As an ergonomic choice, [[file:../examples/less/config.nix][=config.nix=]] factors out declarative build
parameters.  [[file:../examples/less/nix/overlay.nix][=nix/overlay.nix=]] illustrates a common and recommended pattern for
managing multi-package builds where packages can depend on both third-party
dependencies as well as one another.  [[file:../examples/less/nix/my-app.nix][=nix/my-app.nix=]] illustrates packaging a
simple shell script with Nix.

** Development features of scaffolded projects

To start, from the root of a scaffolded project you can enter a developer
environment and see some available preconfigured commands:

#+begin_src sh :eval no
nix develop
#+end_src

#+name: scaffold-welcome
#+begin_src sh :dir .. :results output :exports results
nix develop /tmp/my-project-less#default \
    --override-input nix-project path:. \
    --command menu \
    | ansifilter
#+end_src

#+RESULTS: scaffold-welcome
: 
: [[general commands]]
: 
:   menu            - prints this menu
:   project-check   - run all checks/tests/linters
:   project-doc-gen - generate GitHub Markdown from Org files
:   project-format  - format all files in one command
: 

=project-doc-gen= generates documentation tailored for repositories hosted on
GitHub.  It uses the =org2gfm= script/library provided by Nix-project and is
discussed in [[file:project-documenting.org][another document]].

#+name: scaffold-doc-less
#+begin_src sh :dir .. :results silent :exports none
PROJECT_ROOT=$(pwd)
cd /tmp/my-project-less
nix develop \
    --override-input nix-project "path:${PROJECT_ROOT}" \
    --command project-doc-gen
#+end_src

Run =project-format= (no arguments needed) to format in-place all source code
using [[treefmt-nix][treefmt-nix]].

=project-check= is an alias for =nix flake check= to run all checks/tests/lints
with a simple command.

As with all Nix flake-based projects, all normal =nix= commands apply, as
documented in [[file:./nix-usage-flakes.org][the included guide on using Nix flakes]].  For example, you can
run the example program provided by the template with =nix run= (which just
curls the Nix website):

#+name: scaffold-run
#+begin_src sh :dir /tmp/my-project-less :results output :exports both :post crop(text=*this*, first-n=9, last-n=0)
nix run
#+end_src

#+RESULTS: scaffold-run
#+begin_example
Nix Community Survey 2025 is here! Take the Survey
 
Explore Download Learn Values Community Blog Donate Search
Nix Community Survey 2025 is here!Help us improve by sharing your feedback.

Take the Survey

Declarative builds
and deployments.
…
#+end_example

