doc/project-developing-basics.md
- [About this document](#sec-1)
- [Prerequisites](#sec-2)
- [Scaffolding](#sec-3)
  - [Scaffolding a new project](#sec-3-1)
  - [Development features of scaffolded projects](#sec-3-2)
  - [Additional caching of Nix evaluations](#sec-3-3)
- [Authoring flakes](#sec-4)
  - [Overview of `flake.nix`](#sec-4-1)
  - [System-specific flake outputs](#sec-4-2)
  - [Recommended Nix build pattern](#sec-4-3)
  - [Defining overlays](#sec-4-4)
  - [Using `callPackage`](#sec-4-5)
- [Updating dependencies](#sec-5)
- [Next Steps](#sec-6)


# About this document<a id="sec-1"></a>

This document shows how to get started managing a software project using the following in conjunction:

-   the [Nix package manager](https://nixos.org/nix)
-   an experimental feature of Nix called [flakes](https://nixos.wiki/wiki/Flakes)
-   this project, Nix-project.

This document focuses on basics, without the added abstraction complexity of third-party support like [`flake-utils`](https://github.com/numtide/flake-utils) or [`flake-parts`](https://github.com/hercules-ci/flake-parts). A [separate document](project-developing-modules.md) covers development with flakes modules (using `flake-parts`).

> **<span class="underline">NOTE:</span>** To understand more about why to use an experimental feature such as flakes, as well as known trade-offs, please read the provided [supplemental documentation on Nix](nix-introduction.md).

# Prerequisites<a id="sec-2"></a>

If you're new to Nix, consider reading the provided [introduction](nix-introduction.md).

If you don't have Nix set up yet, see the provided [installation and configuration guide](nix-installation.md). You will need Nix's experimental flakes feature enabled to continue following this development guide. Otherwise, you'll need to pass `--extra-experimental-features 'nix-command flakes'` explicitly to call invocations of the `nix` command.

If you don't know how to use basic Nix commands, see the provided [usage guide](nix-usage-flakes.md).

If you're new to the Nix programming language, see the provided [language tutorial](nix-language.md).

# Scaffolding<a id="sec-3"></a>

Nix-project provides two templates you can use to scaffold a new project:

-   `less`: uses Nix flakes directly without projects like [flake-utils](https://github.com/numtide/flake-utils) or [flake-parts](https://github.com/hercules-ci/flake-parts)
-   `more`: uses flakes with more third-party support like [flake-parts](https://github.com/hercules-ci/flake-parts).

Though implemented differently, both `less` and `more` templates have feature parity. That way, you can more easily see how to extend your own project in two different styles.

Adoption of `flake-parts` by the community has been partial. Some appreciate the community-curated module ecosystem it enables. Others dislike the additional abstraction complexity. Note, there's little reason to use `flake-utils` given we can get the same benefit with under ten lines of Nix code as illustrated in the `less` template.

Regardless of whether you use `flake-parts` or not, it's good to understand how to use Nix flakes directly. The rest of this document focuses on the `less` template. A [companion document](project-developing-modules.md) walks through the `more` template.

## Scaffolding a new project<a id="sec-3-1"></a>

We can scaffold a project with the `less` template with the following command:

```sh
nix --refresh \
    flake new \
    --template github:shajra/nix-project/main#less \
    /tmp/my-project-less  # or wherever you want your new project
```

    wrote: "/tmp/my-project-less/README.org"
    wrote: "/tmp/my-project-less/config.nix"
    wrote: "/tmp/my-project-less/flake.nix"
    wrote: "/tmp/my-project-less/nix/my-app.nix"
    wrote: "/tmp/my-project-less/nix/overlay.nix"
    wrote: "/tmp/my-project-less/nix"

The `--refresh` assures that you get the latest template rather than a cached version from a previous invocation.

As is common for all flake-based projects, [`flake.nix`](../examples/less/flake.nix) is the top-level build file. As an ergonomic choice, [`config.nix`](../examples/less/config.nix) factors out declarative build parameters. [`nix/overlay.nix`](../examples/less/nix/overlay.nix) illustrates a common and recommended pattern for managing multi-package builds where packages can depend on both third-party dependencies as well as one another. [`nix/my-app.nix`](../examples/less/nix/my-app.nix) illustrates packaging a simple shell script with Nix.

## Development features of scaffolded projects<a id="sec-3-2"></a>

To start, from the root of a scaffolded project you can enter a developer environment and see some available preconfigured commands:

```sh
nix develop
```

    
    [[general commands]]
    
      menu            - prints this menu
      project-check   - run all checks/tests/linters
      project-doc-gen - generate GitHub Markdown from Org files
      project-format  - format all files in one command

`project-doc-gen` generates documentation tailored for repositories hosted on GitHub. It uses the `org2gfm` script/library provided by Nix-project and is discussed in [another document](project-documenting.md).

Run `project-format` (no arguments needed) to format in-place all source code using [treefmt-nix](https://github.com/numtide/treefmt-nix).

`project-check` is an alias for `nix flake check` to run all checks/tests/lints with a simple command.

As with all Nix flake-based projects, all normal `nix` commands apply, as documented in [the included guide on using Nix flakes](./nix-usage-flakes.md). For example, you can run the example program provided by the template with `nix run` (which just curls the Nix website):

```sh
nix run
```

    Nixos Logo
    Explore Download Learn Governance Community Blog Donate Search
    NixOS 25.11 released Read Announcement
    
    Declarative builds
    and deployments.
    
    Nix is a tool that takes a unique approach to package management and system
    configuration. Learn how to make reproducible, declarative and reliable
    …
