doc/project-developing-basics.md

## Additional caching of Nix evaluations<a id="sec-3-3"></a>

Evaluating Nix expressions can be slow, even with the improvements of Nix flakes. For example, this cost can be felt when running `nix fmt` to run the configured formatter on all source code of the project. Instead, many developers enter a developer environment with `nix develop`, paying the cost of evaluating the Nix expression upon entry, and then running the formatter directly with a command like `project-format` or `treefmt`.

By installing and configuring both [`direnv`](https://direnv.net) and [`nix-direnv`](https://github.com/nix-community/nix-direnv) you can cache Nix evaluations even more aggressively, only rebuilding the environment when dependencies provided by the flake actually change. Note `direnv` comes with built-in support for flakes, and `nix-direnv` improves the caching of this built-in support.

Covering `direnv` and `nix-direnv` in detail is beyond the scope of this document, but the steps to get started should look like:

1.  Install `direnv`
2.  Install `nix-direnv`
3.  At the root of your project:
    1.  `echo 'use flake' > .envrc`
    2.  `direnv allow` (a security gate of `direnv`)

Then when you enter the directory of your project for the first time, a shell prompt hook will evaluate your flake, cache the result, and seamlessly set up environment variables (including the `PATH`) as per the environment provided by `nix develop`.

Popular editors even have plugins/extensions for `direnv` support, for example

-   [`direnv`'s official VSCode plugin](https://github.com/direnv/direnv-vscode)
-   [`direnv`'s official Vim plugin](https://github.com/direnv/direnv.vim)
-   [a popular `direnv` Emacs package](https://github.com/purcell/envrc)

With these plugins, when you open a file within a project with an enabled `.envrc` configuration for `direnv`, your editor will automatically enter the environment to find tools on the `PATH` and other environment variables.

# Authoring flakes<a id="sec-4"></a>

The Nix community generally enjoys the freedom of configuration with a programming language as expressive as Nix. The code in the templates may be clean enough that you can intuit what's going on after [learning the Nix language](./nix-language.md). However, even the small templates provided synthesize a number of standards, conventions, and recommended patterns that may seem unfamiliar. This is a trade-off for having a rich programming language like Nix as a configuration language, rather than a grammar as constrained as YAML, TOML, or JSON.

This section aims to explain the requisite Nix expressions well enough that you can extend the provided templates to whatever you desire.

## Overview of `flake.nix`<a id="sec-4-1"></a>

A good way to start understanding a flakes-based project is to read the `flake.nix` file at the project's root.

Every `flake.nix` file must conform to a standard structure of an attribute set with three attributes, `description`, `inputs`, and `outputs`. Here are some highlights from the `flake.nix` of `less` template:

```nix
{
  description = "Example project with less third-party dependencies";

  inputs = {
    devshell.url = "github:numtide/devshell";
    nixpkgs.url = "github:NixOS/nixpkgs/nixos-25.11";
    nix-project.url = "github:shajra/nix-project";
    treefmt-nix.url = "github:numtide/treefmt-nix";
  };

  outputs =
    inputs@{
      self,
      devshell,
      nixpkgs,
      ...
    }:
        # …
    ;
}
```

The `description` is just a simple textual string.

`inputs` specifies all the dependencies needed by our project. Many of these dependencies could well be flakes themselves. Others might be pointers to online files. Most of these inputs are specified in a URI syntax. See the [official documentation on flake references](https://nixos.org/manual/nix/stable/command-ref/new-cli/nix3-flake.html#flake-references) for more details.

The `less` template has four dependencies:

-   `nix-project` (this project), for document generation
-   [`nixpkgs`](https://github.com/NixOS/nixpkgs), a central library for Nix almost all packages build off of
-   [`devshell`](https://github.com/numtide/devshell), to enhance the `nix develop` experience
-   [`treefmt-nix`](https://github.com/numtide/treefmt-nix), for formatting source code conveniently.

The `outputs` attribute is where we specify what our flake provides. We define it as a function. The head of this function is an attribute set mapping input names to their respective outputs (we also get a special `self` input for the flake we're in the process of defining). The function's body returns an attribute set of everything our flake provides as outputs.

Note that what is specified in `inputs` describes how to get our dependencies, but this is different from the inputs supplied to the `outputs` function, which are the dependencies themselves.

Nix does not strictly enforce the schema of the outputs returned by `outputs` function. However, some attributes are special with respect to defaults searched by various `nix` subcommands. You can run `nix flake check` to see that your flake passes basic checks, including warnings for any outputs not recognized as standard.

The official Nix documentation doesn't yet have a specification of all standard outputs in one place. The Nix wiki, though, has a [useful section on outputs](https://nixos.wiki/wiki/Flakes#Output_schema).

The output attributes produced by the templates include

-   `packages`, referenced by `nix build` and `nix run`
-   `apps`, referenced by `nix run`
-   `devshells`, referenced by `nix develop`
-   `formatters`, referenced by `nix fmt`
-   `checks`, referenced by `nix flake check`

## System-specific flake outputs<a id="sec-4-2"></a>

Flakes, by design, disallow the build platform from being queried, even to see which chipset we will be building on. This restriction ensures some portability and reproducibility, but introduces some complexity when defining and accessing flake outputs. For every package, a flake must provide a different output for each system supported.

Flake outputs exposing packages end up with attribute paths like

-   `packages.<system>.<name>` (how most flakes output packages)
-   `legacyPackages.<system>.<attribute path>` (how [Nixpkgs](https://github.com/NixOS/nixpkgs) outputs packages)

You can see all the systems used by Nix with the following command:

```sh
nix eval nixpkgs#lib.platforms.all
```

The complication means we have to write Nix expressions that build packages for every system we want to support. To assist, the `less` template `flake.nix` file provides two functions, `buildFor` and `forAllSystems`.

Discussed in [another document](project-developing-modules.md), `flake-parts`, used by the `more` template, provides a different abstraction to solve the same problem.
