doc/project-developing-basics.md

## Recommended Nix build pattern<a id="sec-4-3"></a>

Many (though not all) of a flakes outputs are special Nix expressions that specify a Nix package. Building packages from scratch is generally impractical, which is why we almost always use the support of Nixpkgs as a base dependency.

Nixpkgs is an extremely deep and wide nested attribute set, containing well over 120,000 packages and various functions to help build more.

We can then craft special functions, called *overlays* that take one version of Nixpkgs, and overlays on top of it more packages and functions to make a new version.

In code this can look like:

```nix
let
  overlay = import path/to/my/overlay.nix {};  # or whatever args required
  new_nixpkgs = (import prev_nixpkgs) {
    inherit system;  # get system already in scope
    overlays = [ overlay ];
  }
in ⋯
```

Or if you only have one overlay, you may simply see:

```nix
let
  overlay = import path/to/my/overlay.nix {};  # or whatever args required
  new_nixpkgs = prev_nixpkgs.extend overlay;
in ⋯
```

Overlays typically make heavy usage of a function provided by Nixpkgs called `callPackage` to create new packages from preexisting ones. Both overlays and `callPackage` are discussed in greater detail in later sections.

So a *build* in the context of our project is ultimately, a Nixpkgs instance that has all the packages and functions we want to expose through outputs of our flake.

## Defining overlays<a id="sec-4-4"></a>

Both the `less` and `more` templates illustrate the use of overlays, which are defined in their respective `nix/overlay.nix` files, and used in their respective `flake.nix` files.

An overlay has the following form:

```nix
final: prev: {
    # new attributes to be merged into Nixpkgs
}
```

We start with an instance of Nixpkgs, and can chain overlays:

```nix
(nixpkgs.extend overlay1).extend overlay2
```

The `prev` parameter of the overlay allows us to access the version of Nixpkgs the overlay is directly extending. The `final` parameter enables us to access the version of Nixpkgs we'll get when all overlays have been applied.

For those familiar, `final` is the kind of open recursion we get with the `self` or `this` parameter in object-oriented (OO) languages. Similarly `prev` is like `super`. Similar to OO languages, we can use overlays to override packages referenced from `final` in any other overlay. References from `prev` can only be overridden by previous overlays. Overriding is powerful because we can override *all* references to a dependency. Overriding all references helps keep everything in our Nixpkgs instance on the same version for consistency and compatibility.

A typical pattern is to start with Nixpkgs, and extend it with more packages via overlays, until we finally have packages we want to distribute.

Here is the `less` template's overlay:

```nix
inputs: final: prev:
let
  inherit (prev.stdenv.hostPlatform) system;
  config = final.callPackage ../config.nix { };
in
{
  my-app = final.callPackage ./my-app.nix { };

  my-app-mkShell = prev.mkShell config.mkShell;
  my-app-devshell = final.devshell.mkShell { imports = [ config.devshell ]; };
  my-app-org2gfm = inputs.nix-project.lib.${system}.org2gfm-static config.org2gfm;
  my-app-treefmt = inputs.treefmt-nix.lib.evalModule final config.treefmt;
}
```

This generator of an overlay takes the flake's `inputs` as an argument. This way, we can build new packages not only from what's in Nixpkgs, but anything we've pulled in as flake inputs. Within our overlay, we assume that Nixpkgs has already been specialized to a specific platform, which we can get from `prev.stdenv.hostPlatform.system`.

Additionally, the overlay defines a small application using the `callPackage` function from Nixpkgs. This is discussed in the next section.

Worth noting, another overlay can override anything in Nixpkgs or provided by a previous overlay. If building a package involves building some intermediate artifacts, you might want to expose those artifacts by including them in an overlay distributed in your flake's `overlays` output. Distributing overlays enables others to use the overlay and override these intermediate artifacts to get a different build.

## Using `callPackage`<a id="sec-4-5"></a>

Both `less` and `more` templates provide the same definition of an application in `nix/my-app.nix`, which has been written in a common Nix style:

```nix
{
  writeShellApplication,
  curl,
  w3m,
}:

writeShellApplication {
  name = "my-app";
  meta.description = "Example application";
  runtimeInputs = [
    curl
    w3m
  ];
  text = ''
    curl -s 'https://nixos.org' | w3m -dump -T text/html
  '';
}
```

The attribute set input of this function expects dependencies passed in and returns the derivation of a package. All these dependencies happen to exist in a default instance of Nixpkgs:

-   `writeShellApplication` is a Nixpkgs utility to make a package providing a simple shell script.
-   `curl` is the standard cURL program that can download HTTP content.
-   `w3m` is a text-based web browser.

We could pass in these dependencies explicitly, but if there are many dependencies this can get tedious. Nixpkgs comes with a utility function `callPackage` that will

-   inspect (using reflection) the attribute names of the set input of a function
-   call the function passing in values retrieved from Nixpkgs with these names.

Some people recognize this kind of utility as *dependency injection*. The `callPackage` utility accepts two arguments:

1.  the function (or path to a Nix file evaluating to it) with dependencies to be injected
2.  an attribute set to overlay on top of Nixpkgs when looking up dependencies.

Using `final.callPackage`, various packages that depend on one another can be defined in the same overlay. Here's an example:

```nix
final: prev: {
    my-app-a = final.callPackage ({writeShellApplication}: …) {};
    my-app-b = final.callPackage ({writeShellApplication, my-app-a}: …) {};
    my-app-c = final.callPackage ({writeShellApplication, my-app-a, my-app-b}: …) {};
}
```

Here `my-app-a` is a simple shell script that doesn't rely on anything more than shell. `my-app-b` is a script that uses `my-app-a`. And `my-app-c` is a script that uses both `my-app-a` and `my-app-b`. Notice that for these second two `callPackage` calls, we can not use `prev.callPackage`, because dependencies required wouldn't exist until this overlay was applied to Nixpkgs.

Note the final argument of `callPackage` (we're always passing in an empty `{}`) is an opportunity to pass in any dependencies not found in the Nixpkgs instance. However, if you use overlays and `final` effectively, you can easily find yourself not needing any more than an empty `{}`.

Though new packages are often defined using `callPackage`, this is not always the case. For example, in the `less` template `my-app-org2gfm` and `my-app-treefmt` are built from custom functions (not `callPackage`) provided by input flakes. `my-app-devshell` is built from a function made available by a previously applied overlay. And `my-app-mkShell` is built from a standard function provided by Nixpkgs.

Each project will provide its own way of building packages for your flake, but all should fit neatly into the framework of overlays, as illustrated by the templates.

# Updating dependencies<a id="sec-5"></a>

You'll notice the first time you run a `nix` command against your newly scaffolded project, a `flake.lock` lock file will be generated. Flake inputs can point to mutable references like Git repository branches. The lock file pins references to a specific snapshot retrieved.

This lock file should be checked in with your source. This file is what makes your build repeatable.

When we want to update all the dependencies in our lock file, we can run:

```sh
nix flake update
```
