doc/project-developing-basics.org
* Next Steps

This guide and scaffolded projects used as an examples, show how to make
packages providing a simple shell script. You will likely want to start making
packages for other languages.

Nix has an [[nix-learn][official learning starting point]], that is a good next step. In
particular, you will find yourself reading the [[nixpkgs-manual][Nixpkgs manual]].

The guides included in this project cover more of the language-agnostic aspects
of Nix and Nixpkgs. Each programming language ecosystem has its set of unique
requirements and idiosyncrasies. Nixpkgs provide functions to assist with each
language, which can lead to some divergent experiences when packaging and
developing with Nix. The Nixpkgs manual has [[nixpkgs-manual-langs][dedicated sections for each
language]].  Eventually, you will find yourself diving into [[nixpkgs][Nixpkgs source code]].

The Nix ecosystem is vast. This project and documentation illustrate just a
small sample of what Nix can do.

* Org-mode cleanup :noexport:

Cleans directory for run:

#+call: cleanup()
