doc/project-developing-basics.md

# Next Steps<a id="sec-6"></a>

This guide and scaffolded projects used as an examples, show how to make packages providing a simple shell script. You will likely want to start making packages for other languages.

Nix has an [official learning starting point](https://nixos.org/learn.html), that is a good next step. In particular, you will find yourself reading the [Nixpkgs manual](https://nixos.org/nixpkgs/manual).

The guides included in this project cover more of the language-agnostic aspects of Nix and Nixpkgs. Each programming language ecosystem has its set of unique requirements and idiosyncrasies. Nixpkgs provide functions to assist with each language, which can lead to some divergent experiences when packaging and developing with Nix. The Nixpkgs manual has [dedicated sections for each language](https://nixos.org/manual/nixpkgs/stable/#chap-language-support). Eventually, you will find yourself diving into [Nixpkgs source code](https://github.com/NixOS/nixpkgs).

The Nix ecosystem is vast. This project and documentation illustrate just a small sample of what Nix can do.
